garyPenhook/PIC-Assembler/edc/PIC18F27Q10.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CLC2GLS2" edc:desc="Gate logic select register 2" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="CLC2GLS2" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02286_cla_clc_v5_8bit.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0xE39">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="G3D1N" edc:desc="" edc:mask="0x1" edc:name="G3D1N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3D1T" edc:desc="" edc:mask="0x1" edc:name="G3D1T" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3D2N" edc:desc="" edc:mask="0x1" edc:name="G3D2N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3D2T" edc:desc="" edc:mask="0x1" edc:name="G3D2T" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3D3N" edc:desc="" edc:mask="0x1" edc:name="G3D3N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3D3T" edc:desc="" edc:mask="0x1" edc:name="G3D3T" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3D4N" edc:desc="" edc:mask="0x1" edc:name="G3D4N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3D4T" edc:desc="" edc:mask="0x1" edc:name="G3D4T" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="LC2G3D1N" edc:desc="" edc:mask="0x1" edc:name="LC2G3D1N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC2G3D1T" edc:desc="" edc:mask="0x1" edc:name="LC2G3D1T" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC2G3D2N" edc:desc="" edc:mask="0x1" edc:name="LC2G3D2N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC2G3D2T" edc:desc="" edc:mask="0x1" edc:name="LC2G3D2T" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC2G3D3N" edc:desc="" edc:mask="0x1" edc:name="LC2G3D3N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC2G3D3T" edc:desc="" edc:mask="0x1" edc:name="LC2G3D3T" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC2G3D4N" edc:desc="" edc:mask="0x1" edc:name="LC2G3D4N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC2G3D4T" edc:desc="" edc:mask="0x1" edc:name="LC2G3D4T" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CLC2GLS3" edc:desc="Gate logic select register 3" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="CLC2GLS3" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02286_cla_clc_v5_8bit.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0xE3A">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="G4D1N" edc:desc="" edc:mask="0x1" edc:name="G4D1N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4D1T" edc:desc="" edc:mask="0x1" edc:name="G4D1T" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4D2N" edc:desc="" edc:mask="0x1" edc:name="G4D2N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4D2T" edc:desc="" edc:mask="0x1" edc:name="G4D2T" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4D3N" edc:desc="" edc:mask="0x1" edc:name="G4D3N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4D3T" edc:desc="" edc:mask="0x1" edc:name="G4D3T" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4D4N" edc:desc="" edc:mask="0x1" edc:name="G4D4N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4D4T" edc:desc="" edc:mask="0x1" edc:name="G4D4T" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="LC2G4D1N" edc:mask="0x1" edc:name="LC2G4D1N" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LC2G4D1T" edc:mask="0x1" edc:name="LC2G4D1T" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LC2G4D2N" edc:mask="0x1" edc:name="LC2G4D2N" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LC2G4D2T" edc:mask="0x1" edc:name="LC2G4D2T" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LC2G4D3N" edc:mask="0x1" edc:name="LC2G4D3N" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LC2G4D3T" edc:mask="0x1" edc:name="LC2G4D3T" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LC2G4D4N" edc:mask="0x1" edc:name="LC2G4D4N" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LC2G4D4T" edc:mask="0x1" edc:name="LC2G4D4T" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="n-rnnnnn" edc:cname="CLC3CON" edc:desc="Configurable logic cell control" edc:impl="0xbf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0-000000" edc:name="CLC3CON" edc:nzwidth="8" edc:por="0-000000" edc:_modsrc="DOS-02286_cla_clc_v5_8bit.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0xE3B">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="MODE" edc:desc="" edc:mask="0x7" edc:name="MODE" edc:nzwidth="3"/>
              <edc:SFRFieldDef edc:cname="INTN" edc:desc="" edc:mask="0x1" edc:name="INTN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INTP" edc:desc="" edc:mask="0x1" edc:name="INTP" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OUT" edc:desc="" edc:mask="0x1" edc:name="OUT" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="EN" edc:desc="" edc:mask="0x1" edc:name="EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="MODE0" edc:mask="0x1" edc:name="MODE0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MODE1" edc:mask="0x1" edc:name="MODE1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MODE2" edc:mask="0x1" edc:name="MODE2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="LC3MODE" edc:desc="" edc:mask="0x7" edc:name="LC3MODE" edc:nzwidth="3"/>
              <edc:SFRFieldDef edc:cname="LC3INTN" edc:desc="" edc:mask="0x1" edc:name="LC3INTN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC3INTP" edc:desc="" edc:mask="0x1" edc:name="LC3INTP" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC3OUT" edc:desc="" edc:mask="0x1" edc:name="LC3OUT" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="LC3EN" edc:desc="" edc:mask="0x1" edc:name="LC3EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="LC3MODE0" edc:mask="0x1" edc:name="LC3MODE0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LC3MODE1" edc:mask="0x1" edc:name="LC3MODE1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LC3MODE2" edc:mask="0x1" edc:name="LC3MODE2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
