garyPenhook/PIC-Assembler/edc/PIC18F27Q10.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CLC4GLS0" edc:desc="Gate logic select register 0" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="CLC4GLS0" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02286_cla_clc_v5_8bit.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0xE4B">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="G1D1N" edc:desc="" edc:mask="0x1" edc:name="G1D1N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1D1T" edc:desc="" edc:mask="0x1" edc:name="G1D1T" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1D2N" edc:desc="" edc:mask="0x1" edc:name="G1D2N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1D2T" edc:desc="" edc:mask="0x1" edc:name="G1D2T" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1D3N" edc:desc="" edc:mask="0x1" edc:name="G1D3N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1D3T" edc:desc="" edc:mask="0x1" edc:name="G1D3T" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1D4N" edc:desc="" edc:mask="0x1" edc:name="G1D4N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1D4T" edc:desc="" edc:mask="0x1" edc:name="G1D4T" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="LC4G1D1N" edc:desc="" edc:mask="0x1" edc:name="LC4G1D1N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC4G1D1T" edc:desc="" edc:mask="0x1" edc:name="LC4G1D1T" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC4G1D2N" edc:desc="" edc:mask="0x1" edc:name="LC4G1D2N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC4G1D2T" edc:desc="" edc:mask="0x1" edc:name="LC4G1D2T" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC4G1D3N" edc:desc="" edc:mask="0x1" edc:name="LC4G1D3N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC4G1D3T" edc:desc="" edc:mask="0x1" edc:name="LC4G1D3T" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC4G1D4N" edc:desc="" edc:mask="0x1" edc:name="LC4G1D4N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC4G1D4T" edc:desc="" edc:mask="0x1" edc:name="LC4G1D4T" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CLC4GLS1" edc:desc="Gate logic select register 1" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="CLC4GLS1" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02286_cla_clc_v5_8bit.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0xE4C">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="G2D1N" edc:desc="" edc:mask="0x1" edc:name="G2D1N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G2D1T" edc:desc="" edc:mask="0x1" edc:name="G2D1T" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G2D2N" edc:desc="" edc:mask="0x1" edc:name="G2D2N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G2D2T" edc:desc="" edc:mask="0x1" edc:name="G2D2T" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G2D3N" edc:desc="" edc:mask="0x1" edc:name="G2D3N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G2D3T" edc:desc="" edc:mask="0x1" edc:name="G2D3T" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G2D4N" edc:desc="" edc:mask="0x1" edc:name="G2D4N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G2D4T" edc:desc="" edc:mask="0x1" edc:name="G2D4T" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="LC4G2D1N" edc:desc="" edc:mask="0x1" edc:name="LC4G2D1N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC4G2D1T" edc:desc="" edc:mask="0x1" edc:name="LC4G2D1T" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC4G2D2N" edc:desc="" edc:mask="0x1" edc:name="LC4G2D2N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC4G2D2T" edc:desc="" edc:mask="0x1" edc:name="LC4G2D2T" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC4G2D3N" edc:desc="" edc:mask="0x1" edc:name="LC4G2D3N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC4G2D3T" edc:desc="" edc:mask="0x1" edc:name="LC4G2D3T" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC4G2D4N" edc:desc="" edc:mask="0x1" edc:name="LC4G2D4N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC4G2D4T" edc:desc="" edc:mask="0x1" edc:name="LC4G2D4T" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CLC4GLS2" edc:desc="Gate logic select register 2" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="CLC4GLS2" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02286_cla_clc_v5_8bit.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0xE4D">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="G3D1N" edc:desc="" edc:mask="0x1" edc:name="G3D1N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3D1T" edc:desc="" edc:mask="0x1" edc:name="G3D1T" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3D2N" edc:desc="" edc:mask="0x1" edc:name="G3D2N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3D2T" edc:desc="" edc:mask="0x1" edc:name="G3D2T" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3D3N" edc:desc="" edc:mask="0x1" edc:name="G3D3N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3D3T" edc:desc="" edc:mask="0x1" edc:name="G3D3T" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3D4N" edc:desc="" edc:mask="0x1" edc:name="G3D4N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3D4T" edc:desc="" edc:mask="0x1" edc:name="G3D4T" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="LC4G3D1N" edc:desc="" edc:mask="0x1" edc:name="LC4G3D1N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC4G3D1T" edc:desc="" edc:mask="0x1" edc:name="LC4G3D1T" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC4G3D2N" edc:desc="" edc:mask="0x1" edc:name="LC4G3D2N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC4G3D2T" edc:desc="" edc:mask="0x1" edc:name="LC4G3D2T" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC4G3D3N" edc:desc="" edc:mask="0x1" edc:name="LC4G3D3N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC4G3D3T" edc:desc="" edc:mask="0x1" edc:name="LC4G3D3T" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC4G3D4N" edc:desc="" edc:mask="0x1" edc:name="LC4G3D4N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC4G3D4T" edc:desc="" edc:mask="0x1" edc:name="LC4G3D4T" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CLC4GLS3" edc:desc="Gate logic select register 3" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="CLC4GLS3" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02286_cla_clc_v5_8bit.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0xE4E">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="G4D1N" edc:desc="" edc:mask="0x1" edc:name="G4D1N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4D1T" edc:desc="" edc:mask="0x1" edc:name="G4D1T" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4D2N" edc:desc="" edc:mask="0x1" edc:name="G4D2N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4D2T" edc:desc="" edc:mask="0x1" edc:name="G4D2T" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4D3N" edc:desc="" edc:mask="0x1" edc:name="G4D3N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4D3T" edc:desc="" edc:mask="0x1" edc:name="G4D3T" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4D4N" edc:desc="" edc:mask="0x1" edc:name="G4D4N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4D4T" edc:desc="" edc:mask="0x1" edc:name="G4D4T" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="LC4G4D1N" edc:mask="0x1" edc:name="LC4G4D1N" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LC4G4D1T" edc:mask="0x1" edc:name="LC4G4D1T" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LC4G4D2N" edc:mask="0x1" edc:name="LC4G4D2N" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LC4G4D2T" edc:mask="0x1" edc:name="LC4G4D2T" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LC4G4D3N" edc:mask="0x1" edc:name="LC4G4D3N" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LC4G4D3T" edc:mask="0x1" edc:name="LC4G4D3T" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LC4G4D4N" edc:mask="0x1" edc:name="LC4G4D4N" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LC4G4D4T" edc:mask="0x1" edc:name="LC4G4D4T" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="n-rnnnnn" edc:cname="CLC5CON" edc:desc="Configurable logic cell control" edc:impl="0xbf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0-000000" edc:name="CLC5CON" edc:nzwidth="8" edc:por="0-000000" edc:_modsrc="DOS-02286_cla_clc_v5_8bit.Module" edc:_refcount="5" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0xE4F">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="MODE" edc:desc="" edc:mask="0x7" edc:name="MODE" edc:nzwidth="3"/>
              <edc:SFRFieldDef edc:cname="INTN" edc:desc="" edc:mask="0x1" edc:name="INTN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INTP" edc:desc="" edc:mask="0x1" edc:name="INTP" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OUT" edc:desc="" edc:mask="0x1" edc:name="OUT" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="EN" edc:desc="" edc:mask="0x1" edc:name="EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="MODE0" edc:mask="0x1" edc:name="MODE0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MODE1" edc:mask="0x1" edc:name="MODE1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MODE2" edc:mask="0x1" edc:name="MODE2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="LC5MODE" edc:desc="" edc:mask="0x7" edc:name="LC5MODE" edc:nzwidth="3"/>
              <edc:SFRFieldDef edc:cname="LC5INTN" edc:desc="" edc:mask="0x1" edc:name="LC5INTN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC5INTP" edc:desc="" edc:mask="0x1" edc:name="LC5INTP" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC5OUT" edc:desc="" edc:mask="0x1" edc:name="LC5OUT" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="LC5EN" edc:desc="" edc:mask="0x1" edc:name="LC5EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="LC5MODE0" edc:mask="0x1" edc:name="LC5MODE0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LC5MODE1" edc:mask="0x1" edc:name="LC5MODE1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LC5MODE2" edc:mask="0x1" edc:name="LC5MODE2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="n---nnnn" edc:cname="CLC5POL" edc:desc="Polarity control" edc:impl="0x8f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0---uuuu" edc:name="CLC5POL" edc:nzwidth="8" edc:por="0---xxxx" edc:_modsrc="DOS-02286_cla_clc_v5_8bit.Module" edc:_refcount="5" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0xE50">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="G1POL" edc:desc="" edc:mask="0x1" edc:name="G1POL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G2POL" edc:desc="" edc:mask="0x1" edc:name="G2POL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3POL" edc:desc="" edc:mask="0x1" edc:name="G3POL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4POL" edc:desc="" edc:mask="0x1" edc:name="G4POL" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="POL" edc:desc="" edc:mask="0x1" edc:name="POL" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="LC5G1POL" edc:desc="" edc:mask="0x1" edc:name="LC5G1POL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC5G2POL" edc:desc="" edc:mask="0x1" edc:name="LC5G2POL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC5G3POL" edc:desc="" edc:mask="0x1" edc:name="LC5G3POL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC5G4POL" edc:desc="" edc:mask="0x1" edc:name="LC5G4POL" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="LC5POL" edc:desc="" edc:mask="0x1" edc:name="LC5POL" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
