garyPenhook/PIC-Assembler/edc/PIC18F27Q10.PIC
        <edc:SFRDef edc:access="---nnnnn" edc:cname="SSP2SSPPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="SSP2SSPPS" edc:nzwidth="8" edc:por="---01000" edc:_addr="0xE8C">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PIN" edc:mask="0x7" edc:name="PIN" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="PORT" edc:mask="0x3" edc:name="PORT" edc:nzwidth="0x2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="SSP2SSPPS0" edc:mask="0x1" edc:name="SSP2SSPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SSP2SSPPS1" edc:mask="0x1" edc:name="SSP2SSPPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SSP2SSPPS2" edc:mask="0x1" edc:name="SSP2SSPPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SSP2SSPPS3" edc:mask="0x1" edc:name="SSP2SSPPS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SSP2SSPPS4" edc:mask="0x1" edc:name="SSP2SSPPS4" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="SSP2SSPPS" edc:mask="0x1f" edc:name="SSP2SSPPS" edc:nzwidth="0x5"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="SSP2BUF" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxx" edc:name="SSP2BUF" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02545_mssp_v7_8Bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x7" edc:_addr="0xE8D">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SSPBUF" edc:desc="" edc:mask="0xff" edc:name="SSPBUF" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="SSP2ADD" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="SSP2ADD" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02545_mssp_v7_8Bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x7" edc:_addr="0xE8E">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SSPADD" edc:desc="" edc:mask="0xff" edc:name="SSPADD" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="MSK0" edc:desc="" edc:mask="0x1" edc:name="MSK0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MSK1" edc:desc="" edc:mask="0x1" edc:name="MSK1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MSK2" edc:desc="" edc:mask="0x1" edc:name="MSK2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MSK3" edc:desc="" edc:mask="0x1" edc:name="MSK3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MSK4" edc:desc="" edc:mask="0x1" edc:name="MSK4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MSK5" edc:desc="" edc:mask="0x1" edc:name="MSK5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MSK6" edc:desc="" edc:mask="0x1" edc:name="MSK6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MSK7" edc:desc="" edc:mask="0x1" edc:name="MSK7" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.1">
              <edc:SFRFieldDef edc:cname="MSK02" edc:desc="" edc:mask="0x1" edc:name="MSK02" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MSK12" edc:desc="" edc:mask="0x1" edc:name="MSK12" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MSK22" edc:desc="" edc:mask="0x1" edc:name="MSK22" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MSK32" edc:desc="" edc:mask="0x1" edc:name="MSK32" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MSK42" edc:desc="" edc:mask="0x1" edc:name="MSK42" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MSK52" edc:desc="" edc:mask="0x1" edc:name="MSK52" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MSK62" edc:desc="" edc:mask="0x1" edc:name="MSK62" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MSK72" edc:desc="" edc:mask="0x1" edc:name="MSK72" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="SSP2MSK" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11111111" edc:name="SSP2MSK" edc:nzwidth="8" edc:por="11111111" edc:_modsrc="DOS-02545_mssp_v7_8Bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x7" edc:_addr="0xE8F">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SSPMSK" edc:desc="" edc:mask="0xff" edc:name="SSPMSK" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="MSK0" edc:desc="" edc:mask="0x1" edc:name="MSK0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MSK1" edc:desc="" edc:mask="0x1" edc:name="MSK1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MSK2" edc:desc="" edc:mask="0x1" edc:name="MSK2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MSK3" edc:desc="" edc:mask="0x1" edc:name="MSK3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MSK4" edc:desc="" edc:mask="0x1" edc:name="MSK4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MSK5" edc:desc="" edc:mask="0x1" edc:name="MSK5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MSK6" edc:desc="" edc:mask="0x1" edc:name="MSK6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MSK7" edc:desc="" edc:mask="0x1" edc:name="MSK7" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnrrrrrr" edc:cname="SSP2STAT" edc:desc="MSSP2 STATUS REGISTER" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="SSP2STAT" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02545_mssp_v7_8Bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x7" edc:_addr="0xE90">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="BF" edc:desc="Buffer Full Status bit (Receive mode only)" edc:mask="0x1" edc:name="BF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="UA" edc:desc="Update Address bit" edc:mask="0x1" edc:name="UA" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="R_nW" edc:desc="Read/Write Information bit" edc:mask="0x1" edc:name="R_nW" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S" edc:desc="Start bit" edc:mask="0x1" edc:name="S" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="P" edc:desc="Stop bit" edc:mask="0x1" edc:name="P" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="D_nA" edc:desc="Data/Address bit" edc:mask="0x1" edc:name="D_nA" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CKE" edc:desc="SPI Clock Edge Select bit" edc:mask="0x1" edc:name="CKE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SMP" edc:desc="SPI Data Input Sample Phase bit" edc:mask="0x1" edc:name="SMP" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="R_W" edc:desc="" edc:mask="0x1" edc:name="R_W" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="D_A" edc:desc="" edc:mask="0x1" edc:name="D_A" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="nW" edc:desc="" edc:mask="0x1" edc:name="nW" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="nA" edc:desc="" edc:mask="0x1" edc:name="nA" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="nWRITE" edc:desc="" edc:mask="0x1" edc:name="nWRITE" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="nADDRESS" edc:desc="" edc:mask="0x1" edc:name="nADDRESS" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.3">
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="READ_WRITE" edc:desc="" edc:mask="0x1" edc:name="READ_WRITE" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="DATA_ADDRESS" edc:desc="" edc:mask="0x1" edc:name="DATA_ADDRESS" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.4">
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="I2C_READ" edc:desc="" edc:mask="0x1" edc:name="I2C_READ" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="I2C_START" edc:desc="" edc:mask="0x1" edc:name="I2C_START" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="I2C_STOP" edc:desc="" edc:mask="0x1" edc:name="I2C_STOP" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="I2C_DAT" edc:desc="" edc:mask="0x1" edc:name="I2C_DAT" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="BF2" edc:desc="" edc:mask="0x1" edc:name="BF2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="UA2" edc:desc="" edc:mask="0x1" edc:name="UA2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="R" edc:desc="" edc:mask="0x1" edc:name="R" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="START" edc:desc="" edc:mask="0x1" edc:name="START" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="STOP" edc:desc="" edc:mask="0x1" edc:name="STOP" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="D" edc:desc="" edc:mask="0x1" edc:name="D" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CKE2" edc:desc="" edc:mask="0x1" edc:name="CKE2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SMP2" edc:desc="" edc:mask="0x1" edc:name="SMP2" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.1">
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="RW" edc:desc="" edc:mask="0x1" edc:name="RW" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="START2" edc:desc="" edc:mask="0x1" edc:name="START2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="STOP2" edc:desc="" edc:mask="0x1" edc:name="STOP2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DA" edc:desc="" edc:mask="0x1" edc:name="DA" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.2">
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="RW2" edc:desc="" edc:mask="0x1" edc:name="RW2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="I2C_START2" edc:desc="" edc:mask="0x1" edc:name="I2C_START2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="I2C_STOP2" edc:desc="" edc:mask="0x1" edc:name="I2C_STOP2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DA2" edc:desc="" edc:mask="0x1" edc:name="DA2" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.3">
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="I2C_READ2" edc:desc="" edc:mask="0x1" edc:name="I2C_READ2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S2" edc:desc="" edc:mask="0x1" edc:name="S2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="P2" edc:desc="" edc:mask="0x1" edc:name="P2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DATA_ADDRESS2" edc:desc="" edc:mask="0x1" edc:name="DATA_ADDRESS2" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.4">
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="READ_WRITE2" edc:desc="" edc:mask="0x1" edc:name="READ_WRITE2" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="D_A2" edc:desc="" edc:mask="0x1" edc:name="D_A2" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.5">
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="R_W2" edc:desc="" edc:mask="0x1" edc:name="R_W2" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="D_nA2" edc:desc="" edc:mask="0x1" edc:name="D_nA2" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.6">
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="R_nW2" edc:desc="" edc:mask="0x1" edc:name="R_nW2" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="I2C_DAT2" edc:desc="" edc:mask="0x1" edc:name="I2C_DAT2" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.7">
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="nW2" edc:desc="" edc:mask="0x1" edc:name="nW2" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="nA2" edc:desc="" edc:mask="0x1" edc:name="nA2" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.8">
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="nWRITE2" edc:desc="" edc:mask="0x1" edc:name="nWRITE2" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="nADDRESS2" edc:desc="" edc:mask="0x1" edc:name="nADDRESS2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
