garyPenhook/PIC-Assembler/edc/PIC18F27Q10.PIC
        <edc:SFRDef edc:access="------nn" edc:cname="CM1CON1" edc:desc="COMPARATOR CONTROL REGISTER 1" edc:impl="0x3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------00" edc:name="CM1CON1" edc:nzwidth="8" edc:por="------00" edc:_modsrc="DOS-02728_cmp_rr_ctrl_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0xF35">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="INTN" edc:desc="Comparator Interrupt on Negative going edge Enable bits" edc:mask="0x1" edc:name="INTN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INTP" edc:desc="Comparator Interrupt on Positive going edge Enable bits" edc:mask="0x1" edc:name="INTP" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="C1INTN" edc:desc="Comparator Interrupt on Negative going edge Enable bits" edc:mask="0x1" edc:name="C1INTN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C1INTP" edc:desc="Comparator Interrupt on Positive going edge Enable bits" edc:mask="0x1" edc:name="C1INTP" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-----nnn" edc:cname="CM1NCH" edc:desc="COMPARATOR INVERTING CHANNEL SELECT REGISTER" edc:impl="0x7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----000" edc:name="CM1NCH" edc:nzwidth="8" edc:por="-----000" edc:_modsrc="DOS-02728_cmp_rr_ctrl_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0xF36">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="NCH" edc:desc="Comparator Inverting Input Channel Select bits" edc:mask="0x7" edc:name="NCH" edc:nzwidth="3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.1">
              <edc:SFRFieldDef edc:cname="NCH0" edc:desc="Comparator Inverting Input Channel Select bits" edc:mask="0x1" edc:name="NCH0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="NCH1" edc:desc="Comparator Inverting Input Channel Select bits" edc:mask="0x1" edc:name="NCH1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="NCH2" edc:desc="Comparator Inverting Input Channel Select bits" edc:mask="0x1" edc:name="NCH2" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="C1NCH0" edc:desc="Comparator Inverting Input Channel Select bits" edc:mask="0x1" edc:name="C1NCH0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C1NCH1" edc:desc="Comparator Inverting Input Channel Select bits" edc:mask="0x1" edc:name="C1NCH1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C1NCH2" edc:desc="Comparator Inverting Input Channel Select bits" edc:mask="0x1" edc:name="C1NCH2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-----nnn" edc:cname="CM1PCH" edc:desc="COMPARATOR NON-INVERTING CHANNEL SELECT REGISTER" edc:impl="0x7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----000" edc:name="CM1PCH" edc:nzwidth="8" edc:por="-----000" edc:_modsrc="DOS-02728_cmp_rr_ctrl_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0xF37">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PCH" edc:desc="Comparator Non-Inverting Input Channel Select bits" edc:mask="0x7" edc:name="PCH" edc:nzwidth="3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.1">
              <edc:SFRFieldDef edc:cname="PCH0" edc:desc="Comparator Non-Inverting Input Channel Select bits" edc:mask="0x1" edc:name="PCH0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PCH1" edc:desc="Comparator Non-Inverting Input Channel Select bits" edc:mask="0x1" edc:name="PCH1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PCH2" edc:desc="Comparator Non-Inverting Input Channel Select bits" edc:mask="0x1" edc:name="PCH2" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="C1PCH0" edc:desc="Comparator Non-Inverting Input Channel Select bits" edc:mask="0x1" edc:name="C1PCH0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C1PCH1" edc:desc="Comparator Non-Inverting Input Channel Select bits" edc:mask="0x1" edc:name="C1PCH1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C1PCH2" edc:desc="Comparator Non-Inverting Input Channel Select bits" edc:mask="0x1" edc:name="C1PCH2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="------rr" edc:cname="CMOUT" edc:desc="" edc:impl="0x3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------00" edc:name="CMOUT" edc:nzwidth="8" edc:por="------00" edc:_addr="0xF38">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="MC1OUT" edc:mask="0x1" edc:name="MC1OUT" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MC2OUT" edc:mask="0x1" edc:name="MC2OUT" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="n--nnnnn" edc:cname="CLKRCON" edc:desc="" edc:impl="0x9f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00010000" edc:name="CLKRCON" edc:nzwidth="8" edc:por="00010000" edc:_addr="0xF39">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DIV" edc:mask="0x7" edc:name="DIV" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="DC" edc:mask="0x3" edc:name="DC" edc:nzwidth="0x2"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="EN" edc:mask="0x1" edc:name="EN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CLKRDIV0" edc:mask="0x1" edc:name="CLKRDIV0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLKRDIV1" edc:mask="0x1" edc:name="CLKRDIV0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLKRDIV2" edc:mask="0x1" edc:name="CLKRDIV0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLKRDC0" edc:mask="0x1" edc:name="CLKRDC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLKRDC1" edc:mask="0x1" edc:name="CLKRDC0" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="CLKREN" edc:mask="0x1" edc:name="CLKREN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="DIV0" edc:mask="0x1" edc:name="DIV0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DIV1" edc:mask="0x1" edc:name="DIV0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DIV2" edc:mask="0x1" edc:name="DIV0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DC0" edc:mask="0x1" edc:name="DC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DC1" edc:mask="0x1" edc:name="DC0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-----nnn" edc:cname="CLKRCLK" edc:desc="" edc:impl="0x7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----000" edc:name="CLKRCLK" edc:nzwidth="8" edc:por="-----000" edc:_addr="0xF3A">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CLK" edc:mask="0x7" edc:name="CLK" edc:nzwidth="0x3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CLKRCLK0" edc:mask="0x1" edc:name="CLKRCLK0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLKRCLK1" edc:mask="0x1" edc:name="CLKRCLK0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLKRCLK2" edc:mask="0x1" edc:name="CLKRCLK0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="CLK0" edc:mask="0x1" edc:name="CLK0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLK1" edc:mask="0x1" edc:name="CLK0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLK2" edc:mask="0x1" edc:name="CLK0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-------n" edc:cname="CWG1CLK" edc:desc="" edc:impl="0x1" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------0" edc:name="CWG1CLK" edc:nzwidth="8" edc:por="-------0" edc:_modsrc="DOS-02485_wg_cwg_v1_K40_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x9" edc:_addr="0xF3B">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="CWG1CLKCON"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CS" edc:desc="" edc:mask="0x1" edc:name="CS" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CWG1CS" edc:desc="" edc:mask="0x1" edc:name="CWG1CS" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="CWG1ISM" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000" edc:name="CWG1ISM" edc:nzwidth="8" edc:por="---00000" edc:_modsrc="DOS-02485_wg_cwg_v1_K40_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x9" edc:_addr="0xF3C">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IS" edc:mask="0x1f" edc:name="IS" edc:nzwidth="0x5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CWG1ISM0" edc:mask="0x1" edc:name="CWG1ISM0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWG1ISM1" edc:mask="0x1" edc:name="CWG1ISM0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWG1ISM2" edc:mask="0x1" edc:name="CWG1ISM0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWG1ISM3" edc:mask="0x1" edc:name="CWG1ISM0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWG1ISM4" edc:mask="0x1" edc:name="CWG1ISM4" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="CWG1DBR" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="CWG1DBR" edc:nzwidth="8" edc:por="--000000" edc:_modsrc="DOS-02485_wg_cwg_v1_K40_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x9" edc:_addr="0xF3D">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DBR" edc:desc="" edc:mask="0x3f" edc:name="DBR" edc:nzwidth="6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="DBR0" edc:desc="" edc:mask="0x1" edc:name="DBR0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DBR1" edc:desc="" edc:mask="0x1" edc:name="DBR1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DBR2" edc:desc="" edc:mask="0x1" edc:name="DBR2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DBR3" edc:desc="" edc:mask="0x1" edc:name="DBR3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DBR4" edc:desc="" edc:mask="0x1" edc:name="DBR4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DBR5" edc:desc="" edc:mask="0x1" edc:name="DBR5" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="CWG1DBR" edc:desc="" edc:mask="0x3f" edc:name="CWG1DBR" edc:nzwidth="6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="CWG1DBR0" edc:desc="" edc:mask="0x1" edc:name="CWG1DBR0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CWG1DBR1" edc:desc="" edc:mask="0x1" edc:name="CWG1DBR1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CWG1DBR2" edc:desc="" edc:mask="0x1" edc:name="CWG1DBR2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CWG1DBR3" edc:desc="" edc:mask="0x1" edc:name="CWG1DBR3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CWG1DBR4" edc:desc="" edc:mask="0x1" edc:name="CWG1DBR4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CWG1DBR5" edc:desc="" edc:mask="0x1" edc:name="CWG1DBR5" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="CWG1DBF" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="CWG1DBF" edc:nzwidth="8" edc:por="--000000" edc:_modsrc="DOS-02485_wg_cwg_v1_K40_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x9" edc:_addr="0xF3E">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DBF" edc:desc="" edc:mask="0x3f" edc:name="DBF" edc:nzwidth="6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="DBF0" edc:desc="" edc:mask="0x1" edc:name="DBF0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DBF1" edc:desc="" edc:mask="0x1" edc:name="DBF1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DBF2" edc:desc="" edc:mask="0x1" edc:name="DBF2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DBF3" edc:desc="" edc:mask="0x1" edc:name="DBF3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DBF4" edc:desc="" edc:mask="0x1" edc:name="DBF4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DBF5" edc:desc="" edc:mask="0x1" edc:name="DBF5" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="CWG1DBF" edc:desc="" edc:mask="0x3f" edc:name="CWG1DBF" edc:nzwidth="6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="CWG1DBF0" edc:desc="" edc:mask="0x1" edc:name="CWG1DBF0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CWG1DBF1" edc:desc="" edc:mask="0x1" edc:name="CWG1DBF1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CWG1DBF2" edc:desc="" edc:mask="0x1" edc:name="CWG1DBF2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CWG1DBF3" edc:desc="" edc:mask="0x1" edc:name="CWG1DBF3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CWG1DBF4" edc:desc="" edc:mask="0x1" edc:name="CWG1DBF4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CWG1DBF5" edc:desc="" edc:mask="0x1" edc:name="CWG1DBF5" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nn---nnn" edc:cname="CWG1CON0" edc:desc="" edc:impl="0xc7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00---000" edc:name="CWG1CON0" edc:nzwidth="8" edc:por="00---000" edc:_modsrc="DOS-02485_wg_cwg_v1_K40_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x9" edc:_addr="0xF3F">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="MODE" edc:desc="" edc:mask="0x7" edc:name="MODE" edc:nzwidth="3"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="LD" edc:desc="" edc:mask="0x1" edc:name="LD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EN" edc:desc="" edc:mask="0x1" edc:name="EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="MODE0" edc:desc="" edc:mask="0x1" edc:name="MODE0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MODE1" edc:desc="" edc:mask="0x1" edc:name="MODE1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MODE2" edc:desc="" edc:mask="0x1" edc:name="MODE2" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="G1EN" edc:desc="" edc:mask="0x1" edc:name="G1EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="CWG1MODE" edc:desc="" edc:mask="0x7" edc:name="CWG1MODE" edc:nzwidth="3"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="CWG1LD" edc:desc="" edc:mask="0x1" edc:name="CWG1LD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CWG1EN" edc:desc="" edc:mask="0x1" edc:name="CWG1EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="CWG1MODE0" edc:desc="" edc:mask="0x1" edc:name="CWG1MODE0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CWG1MODE1" edc:desc="" edc:mask="0x1" edc:name="CWG1MODE1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CWG1MODE2" edc:desc="" edc:mask="0x1" edc:name="CWG1MODE2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
