garyPenhook/PIC-Assembler/edc/PIC18F27Q10.PIC
        <edc:JoinedSFRDef edc:cname="SCANLADR" edc:desc="" edc:name="SCANLADR" edc:nzwidth="0x10" edc:_modsrc="DOS-02730_dma_nvm_v2_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0xF44">
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="SCANLADRL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="SCANLADRL" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02730_dma_nvm_v2_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0xF44">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="LADR" edc:mask="0xff" edc:name="LADR" edc:nzwidth="0x8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="LADR0" edc:mask="0x1" edc:name="LADR0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="LADR1" edc:mask="0x1" edc:name="LADR0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="LADR2" edc:mask="0x1" edc:name="LADR0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="LADR3" edc:mask="0x1" edc:name="LADR0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="LADR4" edc:mask="0x1" edc:name="LADR0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="LADR5" edc:mask="0x1" edc:name="LADR0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="LADR6" edc:mask="0x1" edc:name="LADR0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="LADR7" edc:mask="0x1" edc:name="LADR0" edc:nzwidth="0x1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="SCANLADR" edc:mask="0xff" edc:name="SCANLADR" edc:nzwidth="0x8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.2">
                <edc:SFRFieldDef edc:cname="SCANLADR0" edc:mask="0x1" edc:name="SCANLADR0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SCANLADR1" edc:mask="0x1" edc:name="SCANLADR0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SCANLADR2" edc:mask="0x1" edc:name="SCANLADR0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SCANLADR3" edc:mask="0x1" edc:name="SCANLADR0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SCANLADR4" edc:mask="0x1" edc:name="SCANLADR0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SCANLADR5" edc:mask="0x1" edc:name="SCANLADR0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SCANLADR6" edc:mask="0x1" edc:name="SCANLADR0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SCANLADR7" edc:mask="0x1" edc:name="SCANLADR0" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="SCANLADRH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="SCANLADRH" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02730_dma_nvm_v2_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0xF45">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="LADR" edc:mask="0xff" edc:name="LADR" edc:nzwidth="0x8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="LADR8" edc:mask="0x1" edc:name="LADR8" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="LADR9" edc:mask="0x1" edc:name="LADR9" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="LADR10" edc:mask="0x1" edc:name="LADR10" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="LADR11" edc:mask="0x1" edc:name="LADR11" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="LADR12" edc:mask="0x1" edc:name="LADR12" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="LADR13" edc:mask="0x1" edc:name="LADR13" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="LADR14" edc:mask="0x1" edc:name="LADR14" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="LADR15" edc:mask="0x1" edc:name="LADR15" edc:nzwidth="0x1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="SCANLADR" edc:mask="0xff" edc:name="SCANLADR" edc:nzwidth="0x8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.2">
                <edc:SFRFieldDef edc:cname="SCANLADR8" edc:mask="0x1" edc:name="SCANLADR8" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SCANLADR9" edc:mask="0x1" edc:name="SCANLADR9" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SCANLADR10" edc:mask="0x1" edc:name="SCANLADR10" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SCANLADR11" edc:mask="0x1" edc:name="SCANLADR11" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SCANLADR12" edc:mask="0x1" edc:name="SCANLADR12" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SCANLADR13" edc:mask="0x1" edc:name="SCANLADR13" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SCANLADR14" edc:mask="0x1" edc:name="SCANLADR14" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SCANLADR15" edc:mask="0x1" edc:name="SCANLADR15" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="--nnnnnn" edc:cname="SCANLADRU" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="SCANLADRU" edc:nzwidth="8" edc:por="--000000" edc:_modsrc="DOS-02730_dma_nvm_v2_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0xF46">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="LADR" edc:mask="0x3f" edc:name="LADR" edc:nzwidth="0x6"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="LADR16" edc:mask="0x1" edc:name="LADR16" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="LADR17" edc:mask="0x1" edc:name="LADR17" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="LADR18" edc:mask="0x1" edc:name="LADR18" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="LADR19" edc:mask="0x1" edc:name="LADR19" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="LADR20" edc:mask="0x1" edc:name="LADR20" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="LADR21" edc:mask="0x1" edc:name="LADR21" edc:nzwidth="0x1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="SCANLADR" edc:mask="0x3f" edc:name="SCANLADR" edc:nzwidth="0x6"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.2">
                <edc:SFRFieldDef edc:cname="SCANLADR16" edc:mask="0x1" edc:name="SCANLADR16" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SCANLADR17" edc:mask="0x1" edc:name="SCANLADR17" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SCANLADR18" edc:mask="0x1" edc:name="SCANLADR18" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SCANLADR19" edc:mask="0x1" edc:name="SCANLADR19" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SCANLADR20" edc:mask="0x1" edc:name="SCANLADR20" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SCANLADR21" edc:mask="0x1" edc:name="SCANLADR21" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:JoinedSFRDef edc:cname="SCANHADR" edc:desc="" edc:name="SCANHADR" edc:nzwidth="0x10" edc:_modsrc="DOS-02730_dma_nvm_v2_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0xF47">
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="SCANHADRL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11111111" edc:name="SCANHADRL" edc:nzwidth="8" edc:por="11111111" edc:_modsrc="DOS-02730_dma_nvm_v2_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0xF47">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="HADR" edc:mask="0xff" edc:name="HADR" edc:nzwidth="0x8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="HADR0" edc:mask="0x1" edc:name="HADR0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="HADR1" edc:mask="0x1" edc:name="HADR0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="HADR2" edc:mask="0x1" edc:name="HADR0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="HADR3" edc:mask="0x1" edc:name="HADR0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="HADR4" edc:mask="0x1" edc:name="HADR0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="HADR5" edc:mask="0x1" edc:name="HADR0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="HADR6" edc:mask="0x1" edc:name="HADR0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="HADR7" edc:mask="0x1" edc:name="HADR0" edc:nzwidth="0x1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="SCANHADR" edc:mask="0xff" edc:name="SCANHADR" edc:nzwidth="0x8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.2">
                <edc:SFRFieldDef edc:cname="SCANHADR0" edc:mask="0x1" edc:name="SCANHADR0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SCANHADR1" edc:mask="0x1" edc:name="SCANHADR0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SCANHADR2" edc:mask="0x1" edc:name="SCANHADR0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SCANHADR3" edc:mask="0x1" edc:name="SCANHADR0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SCANHADR4" edc:mask="0x1" edc:name="SCANHADR0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SCANHADR5" edc:mask="0x1" edc:name="SCANHADR0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SCANHADR6" edc:mask="0x1" edc:name="SCANHADR0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SCANHADR7" edc:mask="0x1" edc:name="SCANHADR0" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="SCANHADRH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11111111" edc:name="SCANHADRH" edc:nzwidth="8" edc:por="11111111" edc:_modsrc="DOS-02730_dma_nvm_v2_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0xF48">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="HADR" edc:mask="0xff" edc:name="HADR" edc:nzwidth="0x8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="HADR8" edc:mask="0x1" edc:name="HADR8" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="HADR9" edc:mask="0x1" edc:name="HADR9" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="HADR10" edc:mask="0x1" edc:name="HADR10" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="HADR11" edc:mask="0x1" edc:name="HADR11" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="HADR12" edc:mask="0x1" edc:name="HADR12" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="HADR13" edc:mask="0x1" edc:name="HADR13" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="HADR14" edc:mask="0x1" edc:name="HADR14" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="HADR15" edc:mask="0x1" edc:name="HADR15" edc:nzwidth="0x1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="SCANHADR" edc:mask="0xff" edc:name="SCANHADR" edc:nzwidth="0x8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.2">
                <edc:SFRFieldDef edc:cname="SCANHADR8" edc:mask="0x1" edc:name="SCANHADR8" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SCANHADR9" edc:mask="0x1" edc:name="SCANHADR9" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SCANHADR10" edc:mask="0x1" edc:name="SCANHADR10" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SCANHADR11" edc:mask="0x1" edc:name="SCANHADR11" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SCANHADR12" edc:mask="0x1" edc:name="SCANHADR12" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SCANHADR13" edc:mask="0x1" edc:name="SCANHADR13" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SCANHADR14" edc:mask="0x1" edc:name="SCANHADR14" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SCANHADR15" edc:mask="0x1" edc:name="SCANHADR15" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
