garyPenhook/PIC-Assembler/edc/PIC18F27Q10.PIC
        <edc:SFRDef edc:access="rnnnnnnn" edc:cname="SSP1CON3" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="SSP1CON3" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02545_mssp_v7_8Bit.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x7" edc:_addr="0xF97">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DHEN" edc:desc="" edc:mask="0x1" edc:name="DHEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="AHEN" edc:desc="" edc:mask="0x1" edc:name="AHEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SBCDE" edc:desc="" edc:mask="0x1" edc:name="SBCDE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SDAHT" edc:desc="" edc:mask="0x1" edc:name="SDAHT" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BOEN" edc:desc="" edc:mask="0x1" edc:name="BOEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SCIE" edc:desc="" edc:mask="0x1" edc:name="SCIE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PCIE" edc:desc="" edc:mask="0x1" edc:name="PCIE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ACKTIM" edc:desc="" edc:mask="0x1" edc:name="ACKTIM" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="rrrrrrrr" edc:cname="RC1REG" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="RC1REG" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-01499.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x7" edc:_addr="0xF98">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="RCREG"/>
            <edc:LegacyAlias edc:cname="RCREG1"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RC1REG" edc:desc="" edc:mask="0xff" edc:name="RC1REG" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TX1REG" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="TX1REG" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-01499.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x7" edc:_addr="0xF99">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="TXREG1"/>
            <edc:LegacyAlias edc:cname="TXREG"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TX1REG" edc:desc="" edc:mask="0xff" edc:name="TX1REG" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:JoinedSFRDef edc:cname="SP1BRG" edc:desc="" edc:name="SP1BRG" edc:nzwidth="0x10" edc:_modsrc="DOS-01499.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x7" edc:_addr="0xF9A">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="SPBRG"/>
          </edc:AliasList>
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="SP1BRGL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="SP1BRGL" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-01499.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x7" edc:_addr="0xF9A">
            <edc:AliasList>
              <edc:LegacyAlias edc:cname="SPBRG1"/>
              <edc:LegacyAlias edc:cname="SPBRGL"/>
            </edc:AliasList>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="SP1BRGL" edc:desc="" edc:mask="0xff" edc:name="SP1BRGL" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="SP1BRGH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="SP1BRGH" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-01499.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x7" edc:_addr="0xF9B">
            <edc:AliasList>
              <edc:LegacyAlias edc:cname="SPBRGH"/>
              <edc:LegacyAlias edc:cname="SPBRGH1"/>
            </edc:AliasList>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="SP1BRGH" edc:desc="" edc:mask="0xff" edc:name="SP1BRGH" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:SFRDef edc:access="nnnnnrrr" edc:cname="RC1STA" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="RC1STA" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-01499.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x7" edc:_addr="0xF9C">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="RCSTA1"/>
            <edc:LegacyAlias edc:cname="RCSTA"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RX9D" edc:desc="" edc:mask="0x1" edc:name="RX9D" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OERR" edc:desc="" edc:mask="0x1" edc:name="OERR" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FERR" edc:desc="" edc:mask="0x1" edc:name="FERR" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADDEN" edc:desc="" edc:mask="0x1" edc:name="ADDEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CREN" edc:desc="" edc:mask="0x1" edc:name="CREN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SREN" edc:desc="" edc:mask="0x1" edc:name="SREN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RX9" edc:desc="" edc:mask="0x1" edc:name="RX9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SPEN" edc:desc="" edc:mask="0x1" edc:name="SPEN" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
